#1)REZO თავდაპირველად ვქმნით ხილის სიას
fruits = ["ვაშლი", "ბანანი", "ფორთოხალი"]

# ვცვლით თითოეულ ელემენტს შესაბამისი ქვეყნის სახელით
fruits[0] = "საქართველო"
fruits[1] = "საფრანგეთი"
fruits[2] = "იტალია"

print(fruits)

#2) ვქმნით სტრინგს
text = "დათა"

# ვცდილობთ შევცვალოთ პირველი ინდექსზე მდგომი ასო — შეცდომით
# text[1] = "უ"  # ეს გამოიწვევს შეცდომას

# ვაჩვენოთ შეცდომა კომენტარად:
# TypeError: 'str' object does not support item assignment





#1) შეცვლითაც შეგვიძლია ასე
new_text = "დ" + "უ" + text[2:]
print(new_text)  # გამოიტანს: "დუა"


word = "hidroeleqtrodadguri"

# დავალებაა გამოვიტანოთ "hodroele", მაგრამ სიტყვაში წერია "hidroele..."
# როგორც ჩანს, სავარაუდოდ, ან დაბეჭდვის შეცდომაა ("hodro" უნდა იყოს "hidro")
# თუ სწორი ვარიანტია "hidroele", მაშინ slicing-ი ასე გამოიყურება:

result = word[0:8]  # ინდექსები 0-დან 7-მდე (8 გამორიცხულია)
print(result)


# 2)
names = ["ანა", "გიორგი", "მარი", "ლუკა", "ნიკა", "სოფო", "თეკლა", "ზურა", "დათა", "ლელა"]

# slicing 3-იან ნაბიჯზე
print(names[::3])  # დაიწყებს 0-დან და გადახტება ყოველ მესამე ელემენტზე
