# 1 მომხმარებელს შემოატანინეთ სიმაღლე და გადააქციეთ float ტიპად
height_input = input("შეიყვანეთ თქვენი სიმაღლე (მაგ: 1.75): ")
height = float(height_input)  # აქ ვაფორსებთ float ტიპად
print("თქვენი სიმაღლეა:", height)
print("სიმაღლის ტიპია:", type(height))  # ვამოწმებთ ნამდვილად float-ად გადაიქცა თუ არა

# 2) მომხმარებელს შემოატანინეთ რიცხვი, გადააქციეთ string-ად და შეინახეთ ახალ ცვლადში
number_input = input("შეიყვანეთ ნებისმიერი რიცხვი: ")
number_as_string = str(number_input)  # გადავაქციეთ string-ად
print("ახალი ცვლადის მონაცემთა ტიპი არის:", type(number_as_string))

# 2 მომხმარებელს შემოატანინეთ რიცხვი, გადააქვიეთ string-ად და შეინახეთ ახალ ცვლადში
number_input = input("შეიყვანეთ ნებისმიერი რიცხვი: ")
number_as_string = str(number_input)  # გადავაქციეთ string-ად
print("ახალი ცვლადის მონაცემთა ტიპი არის:", type(number_as_string))

# 3 მომხმარებელს შემოატანინეთ სახელი და შეამოწმეთ, თუ ემთხვევა თქვენს სახელს (მნიშვნელობა არ აქვს ასოების ზომას)
my_name = "ana"  # აქ ჩააყენეთ თქვენი სახელი, მაგალითად "ana"
user_name = input("შეიყვანეთ თქვენი სახელი: ").strip().lower()  # მივიღებთ სახელს, გადააკეთეთ პატარა ასოებად
if user_name == my_name.lower():
    print("თქვენი სახელი ემთხვევა ჩემს სახელს!")
else:
    print("თქვენი სახელი არ ემთხვევა ჩემს სახელს.")


# 4 მომხმარებელს შემოატანინეთ ასაკი და შეამოწმე თუ არის integer და თუ ემთხვევა თქვენს ასაკს
my_age = 25  # აქ ჩააყენეთ თქვენი ასაკი, მაგალითად "25"
user_age_input = input("შეიყვანეთ თქვენი ასაკი: ")

# შევამოწმოთ, რომ რიცხვი არის integer
try:
    user_age = int(user_age_input)  # თუ რიცხვი იყო, გარდაიქმნება integer-ად
    if type(user_age) == int:
        if user_age == my_age:
            print("თქვენი ასაკი ემთხვევა ჩემს ასაკს!")
        else:
            print("თქვენი ასაკი არ ემთხვევა ჩემს ასაკს.")
except ValueError:
    print("თქვენი ასაკი არ არის სწორად შეყვანილი! გთხოვთ, შეიყვანეთ რიცხვი.")


# 5
False or True and False and (True or 5 > 5)
