# 1) მომხმარებელს შემოატანინეთ რიცხვი
number_input = input("შეიყვანეთ რიცხვი: ")

# for loop-ის გამოყენებით თითოეული ციფრის გამოყოფა
for digit in number_input:
    print(digit)


# 2) მომხმარებელს პაროლის შეყვანა მანამ, სანამ სწორად არ შეიყვანს "GOA BEST"

password = ""  # ცარიელი სტრინგით ვიწყებთ

while password != "GOA BEST":
    password = input("შეიყვანეთ პაროლი: ")
    if password != "GOA BEST":
        print("არასწორია, სცადეთ კიდევ!")

print ("ყოჩაღ, პაროლი სწორია ✅ ")


# 3) მომხმარებელს შემოატანინეთ რიცხვი მანამ, სანამ ეს რიცხვი არ იქნება 16-ის ტოლი

number = 0  # საწყისი მნიშვნელობა

while number != 16:
    number = int(input("შეიყვანეთ რიცხვი: "))
    if number != 16:
        print("არასწორია, სცადეთ თავიდან!")

print("გილოცავ! შეიყვანე სწორად — 16 ✅")


# 4) მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვამდე დაპრინტეთ ყველა ეს რიცხვი

number = int(input("შეიყვანეთ რიცხვი: "))

i = 0
while i <= number:
    print(i)
    i += 1


# 5) მომხმარებელს შემოატანინე სახელი და ასაკი მანამ სანამ ორივე სწორად არ შეიყვანს

my_name = "გიორგი"     # ჩაწერე შენი სახელი აქ
my_age = 18            # ჩაწერე შენი ასაკი აქ

while True:
    name = input("შეიყვანეთ სახელი: ")
    age = int(input("შეიყვანეთ ასაკი: "))

    if name == my_name and age == my_age:
        print("ყოჩაღ! სწორად შეიყვანე სახელი და ასაკი ✅")
        break
    else:
        print("არასწორია, სცადე კიდევ 😅")
