# 1) მომხმარებელს შემოატანინეთ სახელი და ამ სახელის თითოეული ასო გამოიტანეთ ცალ-ცალკე
name_input = input("შეიყვანეთ თქვენი სახელი: ")

# თითოეული ასოს ცალ-ცალკე დაპრინტვა
for letter in name_input:
    print(letter)


# 2) მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვი
number_input = input("შეიყვანეთ რიცხვი: ")

# აქ გადაქცევა integer-ად
number = int(number_input)

# ყველა რიცხვის გამოყვანა 0-დან ამ რიცხვის ჩათვლით
for i in range(number + 1):
    print(i)


# 3) მომხმარებელს შემოატანინეთ რიცხვი და ამჯერად ამ რიცხვიდან 0-მდე გამოიტანეთ რიცხვები
number_input = input("შეიყვანეთ რიცხვი: ")

# აქ გადაქცევა integer-ად
number = int(number_input)

# ყველა რიცხვის გამოყვანა ამ რიცხვიდან 0-მდე
for i in range(number, -1, -1):
    print(i)


# 4) მომხმარებელს შემოატანინეთ ორი სტრინგი და დაითვალეთ სიმბოლოების რაოდენობა
string1 = input("შეიყვანეთ პირველი სტრინგი: ")
string2 = input("შეიყვანეთ მეორე სტრინგი: ")

# სიმბოლოების რაოდენობა for loop-ის საშუალებით
count1 = 0
for char in string1:
    count1 += 1

count2 = 0
for char in string2:
    count2 += 1

# დაბეჭდეთ, არის თუ არა სიმბოლოების რაოდენობა ერთნაირი
if count1 == count2:
    print("სტრინგებში სიმბოლოების რაოდენობა ერთმანეთს შეესაბამება.")
else:
    print("სტრინგებში სიმბოლოების რაოდენობა არ ემთხვევა.")

