# 1
# String (სტრინგი) - ტექსტური მონაცემია, ინახება ბრჭყალებში
name = "Luka"         # სტრინგი
city = 'Tbilisi'      # სტრინგი

# Integer (ინტეჯერი) - მთელი რიცხვებია
age = 23              # ინტეჯერი

# Float (ფლოუტი) - ათწილადი რიცხვებია
height = 1.75         # ფლოუტი

# Boolean (ბულიანი) - ლოგიკური მნიშვნელობაა True ან False
is_student = True     # ბულიანი
has_pet = False       # ბულიანი

# 2
# ❌ როგორ არ უნდა ერქვას ცვლადს:
# 1. ცვლადის სახელი არ უნდა იწყებოდეს ციფრით:  1name = "Gio" ❌
# 2. არ უნდა ემთხვეოდეს Python-ის საკვანძო სიტყვებს: if = 10 ❌
# 3. არ უნდა შეიცავდეს სიმბოლოებს როგორიცაა @, #, $, - და ა.შ.: my-name = "Gio" ❌

# ✅ როგორ ჯობია ერქვას:
# - მინიჭეთ ცვლადს აღწერითი სახელი:
user_name = "Gio"
user_age = 20
user_height = 1.75

# = არის მინიჭების ოპერატორი (შენახვა)
# == არის შედარების ოპერატორი (დადარება)

x = 5       # ცვლად x-ს ვანიჭებთ მნიშვნელობას 5
print(x == 5)   # ვამოწმებთ, არის თუ არა x ტოლი 5 → შედეგი True

# 3

 #"name" → ცვლადის სახელი

 #"Nika" → ცვლადის მნიშვნელობა

# 4
# ❌ num 1 == 10  → არასწორი: ცვლადს არ შეიძლება ერქვას ორი სიტყვა ან ჰქონდეს == (შედარება)
# ✅ სწორი:
num1 = 10  # გამოვიყენეთ ერთიანი სახელი და მინიჭების ოპერატორი =

# ❌ academy = Goal Oriented Academy → სტრინგი უნდა იყოს ბრჭყალებში
# ✅ სწორი:
academy = "Goal Oriented Academy"

# ❌ print(name = Name2) → არასწორი სინტაქსი: name და Name2 არ ემთხვევა, კეისს აქვს მნიშვნელობა
# ✅ სწორი:
name = 'Jumbera'
name2 = 'mayvala'
print(name, name2)

# ❌ num = (“30”) → არასწორი ბრჭყალები და Print() დიდი ასოთი
# ✅ სწორი:
num = "30"
print(str(num) + str(20))  # თუ გვსურს შეკრება სტრინგების სახით

# ან თუ გვინდა რიცხვობრივად შეკრება:
print(int(num) + 20)


# 5
# input() - მომხმარებლისგან მონაცემის მიღება
# print() - ეკრანზე ტექსტის ან მონაცემის გამოტანა
# str() - მონაცემის სტრინგად გადაქცევა
# int() - მონაცემის მთელ რიცხვად გადაქცევა
# float() - მონაცემის ათწილადად გადაქცევა

# მაგალითი:
name = input("შეიყვანე შენი სახელი: ")
age = int(input("შეიყვანე ასაკი: "))
height = float(input("შეიყვანე სიმაღლე: "))

print("მოგესალმები,", name)
print("შენ ხარ", age, "წლის და", height, "მეტრი სიმაღლის")


# 6
my_name = "Gio"
user_name = input("შეიყვანე შენი სახელი: ")

if user_name == my_name:
    print("სხვისი სახელი ემთხვევა ჩემსას!")
else:
    print("არ ემთხვევა ჩვენს შორის სახელი.")


# 7
text = input("შეიყვანე ტექსტი: ")

for i in range(10):
    print(text)


# 8
name = input("შეიყვანე შენი სახელი: ")
age = int(input("შეიყვანე ასაკი: "))
height = float(input("შეიყვანე სიმაღლე (მეტრებში): "))

print("მოგესალმები", name + "!", "შენ ხარ", age, "წლის და", height, "მეტრი სიმაღლის.")
