# 4
# შემოათანინეთ ინფორმაცია input functions
car_name = input("შეიყვანეთ ავტომობილის სახელი")             # მერსედესი
car_color = input("შეიყვანეთ ავტომობილის ფერი")              # თეთრი
car_price = int(input("შეიყვანეთ ავტომობილის ფასი (რიცხვით)")) # input-ის რიცხვი
release_year = int(input("შეიყვანეთ ავტომობილის ფასი (რიცხვით)")) # 2015

# გაერთიანება ამ ყველაფრის
result = "ავტომობილის მოდელია" + car_name + " ,მისი ფერია " + car_color + ", ღირებულებაა" + str(release_year) + " წელს."

# შედეგს გამოიტანს
print(result)