# for ციკლი გამოიყენება მაშინ, როდესაც ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
# მაგ: როცა ვმუშაობთ სიაზე ან რიცხვთა დიაპაზონზე.
for i in range(5):
    print("ეს არის for ციკლი, იტერაცია ნომერი:", i)

# while ციკლი გამოიყენება მაშინ, როცა ციკლის შესრულების რაოდენობა წინასწარ უცნობია,
# და უნდა შესრულდეს მანამ, სანამ გარკვეული პირობა სიმართლეა.
i = 0
while i < 5:
    print("ეს არის while ციკლი, იტერაცია ნომერი:", i)
    i += 1

# შეჯამება:
# - for ციკლი გამოიყენება განსაზღვრული რაოდენობის იტერაციებისთვის.
# - while ციკლი გამოიყენება მაშინ, როცა გვსურს პროცესი გაგრძელდეს მანამ, სანამ პირობა არ false-დება.
